#include <stdio.h>
#include <stdbool.h>
#include <stdlib.h>
#include <conio.h>
#include <unistd.h>

int sleepf(int n[20]) //落下してくるの書く（したの位置の数が0である時、一列落下する（0.5秒ぐらい）,落下したくない行（限界の位置）にはあらかじめ2を入れておくことで防ぐ）
{
    int fornum; //testetst
    int jnum;
    int testnum = 1;
    for(fornum = 1; fornum < 21; fornum++)
    {
        printf("%d\n",fornum);
        if(fornum < 11 && n[fornum] == 1) //一列目処理を分けて、0or1かを判別する1のしたが0であるのならば下へ行けるようにしもともと0であるなら飛ばすようにする
        {
            printf("ok\n");
        }
        else
        {
            printf("no\n");
        }
    }

}

int blocf(void)
{
    int n; //横
    int fn; //縦
    int a = 0; //横一列そろったときの計算に使うやつ
    int i = 1; // a + b , b + c...
    int i2; //for用
    int i3 = 0; //横一列判定用

    int bloc[22][15] = {
                            { 0 , 1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 , 10 , 0}, //0行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //1行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //2行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //3行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //4行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //5行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //6行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //7行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //8行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //9行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //10行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //11行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //12行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //13行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //14行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //15行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //16行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //17行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //18行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //19行目0~11
                            { 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0 , 0}, //20行目0~11
                            { 0 , 1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 , 10 , 0}, //21行目0~11
                        };

                for(i2 = 1; i2 < 10; i2++) //横一列がすべて埋まっている場合の処理
                {
                    int ipuls = i+1;
                    a = bloc[1][ipuls] + bloc[1][i]; //a+b , b+c...
                    i++;

                    if(a == 2) //それぞれのa+b,a+c...がそろっている場合i3を足す
                    {
                        i3++; //横一列の合計は9
                    }
                }

                for(fn = 0; fn < 22; fn++) //配列の表示
                {
                    for(n = 0; n < 12; n++)
                    {
                        printf("%d  " , bloc[fn][n]);
                    }

                    printf("\n");
                }
                printf("%d" , i3);
}


int main()
{
    bool endmain = false;
    int test[20] = { 0 , 1 , 0 , 1 , 0 , 1 , 0 , 1 , 0 , 1 , 0 , 1 , 0 , 1 , 0 , 1 , 0 , 1 , 0 , 1};

    while(endmain == false) //実行をやめるプログラムを書く
    {
        system("cls");
            int nobloc[4][5] = {
                             {0,0,0,0,0},
                             {0,0,0,0,0},
                             {0,0,0,0,0},
                             {0,0,0,0,0},
                             };

            int TetI[4][5] = {
                            {1,0,0,0,0},
                            {1,0,0,0,0},
                            {1,0,0,0,0},
                            {1,0,0,0,0},
                            };

            int tetO[4][5] = {
                            {0,0,0,0,0},
                            {0,0,0,0,0},
                            {1,1,0,0,0},
                            {1,1,0,0,0},
                            };
            
            int tetL[4][5] = {
                            {1,0,0,0,0},
                            {1,0,0,0,0},
                            {1,0,0,0,0},
                            {1,1,0,0,0},
                            };

            int tetS[4][5] = {
                            {0,0,0,0,0},
                            {1,0,0,0,0},
                            {1,1,0,0,0},
                            {0,1,0,0,0},
                            };

            int tetT[4][5] = {
                            {0,0,0,0,0},
                            {0,0,0,0,0},
                            {0,1,0,0,0},
                            {1,1,1,0,0},
                            };
        blocf();

        char key; //controlの関数をなくしたやつ
        bool end = false;

        while(end == false) //コントローラーの繰り返し、この前にmain関数の繰り返し
        {
            if(_kbhit()) //キーボードからの入力があるかどうかをチェック
            {
                int sysnum;
                key = _getch(); //キー入力取得

                if(key == 'a' || key == 's' || key == 'd' || key == 'w' || key == 'r' || key == 'e')
                {

                }
                if(key == 'a') //左
                {
                    sysnum = 0;
                    system("cls");
                    end = true;
                }
                else if(key == 'd') //右
                {
                    sysnum = 1;
                    system("cls");
                    end = true;
                }
                else if(key == 'r') //再読み込みやで
                {
                    system("cls");
                    end = true;
                }
                else if(key == 'e') //eで終了
                {
                    end = true;
                    endmain = true;
                    system("cls");
                }
            }
        }
    }
    sleepf(test);
    return 0;
}